@echo off
rem -------------------------------------------------
rem 1. Перейти в каталог проекта (можно задать вручную)
rem -------------------------------------------------
cd C:\donut_music

rem -------------------------------------------------
rem 2. Создать и активировать virtualenv (если ещё нет)
rem -------------------------------------------------
if not exist .venv (
    uv venv .venv
)
call .venv\Scripts\activate

rem -------------------------------------------------
rem 3. Компиляция
rem -------------------------------------------------
uv run setup.py build_ext --inplace
uv run pyinstaller --onefile --console main.py
uv pip install -e .

echo -------------------------------------------------
echo Installation finished.
echo -------------------------------------------------

rem -------------------------------------------------
rem 4. Запуск 3D бублика
rem -------------------------------------------------
uv run .\main.py
pause